// 1. Написать метод, возвращающий минимальное из трех чисел
// 2. Написать метод подсчета количества цифр числа
// 3. С клавиатуры вводятся числа, пока не будет введен 0. Подсчитать сумму всех нечетных положительных чисел.
// 4. Реализовать метод проверки логина и пароля. На вход подается логин и пароль. На выходе истина, если прошел авторизацию, и ложь,
// если не прошел (логин: root, пароль: GeekBrains).
// Используя метод проверки логина и пароля, написать программу: пользователь вводит логин и пароль, программа пропускает его
// дальше или не пропускает. С помощью цикла do while ограничивать ввод пароля 3 попытками.
// 5. а) Написать программу, которая запрашивает массу и рост человека, вычисляет индекс массы тела и сообщает, нужно ли человеку
// похудеть или все в норме.
// б) Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса. ИМТ в норме от 18,5 до 24,99. ИМТ = m/h^2
// 6. *Написать программу подсчета количества “Хороших” чисел в диапазоне от 1 до 1 000 000 000. 
// Хорошим называется число, которое делится на сумму своих цифр.Реализовать подсчет
// времени выполнения программы, используя структуру DateTime.
// 7. a) Разработать рекурсивный метод, который выводит на экран числа от a до b(a<b);
// 8. * Разработать рекурсивный метод, который считает сумму чисел от a до b.
// 9. Тестим предыдущую задачу. Ищем сумму от 5 до 55.




internal class c
{
}